{
    "get_stock_price": "The current price of {ticker} is {price} USD. Would you like to know more about this stock's performance or market trends?",
    "greeting": "Hello! I'm your financial assistant. I can help you with various financial topics including investments, budgeting, savings, and more. What would you like to discuss today?",
    "goodbye": "Thank you for chatting! Remember, I'm here whenever you need financial advice or information. Have a great day!",
    "fallback": "I'm not sure I understand. Could you rephrase your question? I can help with topics like investments, budgeting, savings, retirement planning, and more.",
    "ask_budget_advice": "I'd be happy to help you with budgeting! Could you tell me more about your financial goals and current situation? This will help me provide more specific advice.",
    "balance_inquiry": "To check your bank balance, you can access your online banking or mobile app. Many banks also offer balance alerts and spending tracking features. Would you like to know more about managing your accounts effectively?",
    "investment_advice": "Investing wisely requires understanding your goals, risk tolerance, and time horizon. A diversified portfolio typically includes a mix of stocks, bonds, and other assets. Would you like to discuss specific investment strategies or learn more about different investment options?",
    "card_advice": "Credit cards can be powerful financial tools when used responsibly. Key tips: pay your balance in full each month, understand your interest rates, and take advantage of rewards programs. Would you like specific advice about choosing or managing credit cards?",
    "savings_advice": "Building savings is crucial for financial security. I recommend: 1) Setting up automatic transfers, 2) Creating an emergency fund, 3) Setting specific savings goals. Would you like to discuss any of these strategies in detail?",
    "interest_rates": "Interest rates affect both your savings and borrowing costs. Currently, high-yield savings accounts offer better returns than traditional accounts. For loans, it's important to compare rates and understand the total cost. Would you like to know more about specific interest rate products?",
    "budget_help": "Creating an effective budget involves: 1) Tracking all income and expenses, 2) Categorizing spending, 3) Setting realistic goals, 4) Regular review and adjustment. Would you like help with any of these steps?",
    "general_help": "I can assist you with various financial topics including: budgeting, investing, saving, retirement planning, taxes, insurance, and debt management. What specific area would you like to learn more about?",
    "gambling_warning": "I must advise against gambling as it can lead to significant financial losses. Instead, consider safer investment options like index funds or retirement accounts. Would you like to learn about responsible investment strategies?",
    "retirement_planning": "Planning for retirement is crucial. Consider: 1) Contributing to retirement accounts (401k, IRA), 2) Understanding Social Security benefits, 3) Creating a diversified investment strategy. Would you like to discuss any of these aspects in detail?",
    "tax_advice": "Understanding taxes can help you save money. Key areas to consider: deductions, credits, retirement account contributions, and investment tax implications. Would you like specific information about any of these topics?",
    "insurance_advice": "Insurance is essential for financial protection. Consider: health, life, auto, and home insurance based on your needs. Would you like to learn more about choosing the right coverage for your situation?",
    "debt_management": "Managing debt effectively involves: 1) Understanding interest rates, 2) Creating a repayment plan, 3) Prioritizing high-interest debt. Would you like to discuss strategies for reducing your debt?",
    "financial_goals": "Setting clear financial goals is the first step to success. Consider: short-term goals (emergency fund), medium-term goals (down payment), and long-term goals (retirement). Would you like help creating a plan for your specific goals?",
    "market_analysis": "Market analysis involves understanding economic trends, company performance, and market indicators. Would you like to learn about specific market sectors or investment strategies?",
    "financial_education": "Financial education is key to making informed decisions. I can help you learn about: budgeting, investing, saving, and more. What specific topic would you like to explore?",
    "emergency_fund": "An emergency fund is crucial for financial security. Aim to save 3-6 months of expenses in a liquid account. Would you like help creating a plan to build your emergency fund?",
    "financial_health": "Financial health involves managing your money effectively. Key aspects include: budgeting, saving, investing, and debt management. Would you like to assess your financial health and create an improvement plan?",
    "investment_risk": "Understanding risk is crucial for investing. Consider your risk tolerance, investment timeline, and goals. Would you like to learn more about managing investment risk?",
    "financial_planning": "Financial planning helps you achieve your goals. It involves: budgeting, saving, investing, and protecting your assets. Would you like to create a comprehensive financial plan?",
    "wealth_building": "Building wealth requires a long-term strategy including: saving, investing, and managing debt. Would you like to discuss specific strategies for building wealth?",
    "financial_products": "There are many financial products available. Understanding your needs and goals is key to choosing the right ones. Would you like to learn about specific financial products that might benefit you?"
}
  
